Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་འདི་རྣམས་ལས་གང་ཡང་རུང་བ་སྤྱོད་པ་ན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མི་སེམས་སམ་དེར་ཡོངས་སུ་སྔོ་བར་མི་བྱེད་ན། བྱང་ཆུབ་སེམས་དཔའི་ཉིན་མོ་ཆུད་ཟོས་པ་ཡིན་ཏེ། ཉིན་མོ་དེ་ནི་ཞེན་པ་དང་། རྨུགས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Pūrṇa replied, “Venerable Śāradvatīputra, if bodhisattvas are practicing any of these six perfections but lose sight of omniscience, or fail to dedicate toward omniscience, then those bodhisattvas are wasting their time by involving themselves in craving and dullness.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིད་ཉིན་ནམ། ཡང་ན་ཕྱི་མའི་ཉིན་པར་རམ། ཉི་མ་བཞིའི་ཉིན་པར་སེམས་པར་གྱུར་ཏེ། སྦྱིན་པའམ། ཚུལ་ཁྲིམས་སམ། བཟོད་པའམ། བརྩོན་འགྲུས་སམ། བསམ་གཏན་རྣམས་སམ། ཤེས་རབ་ལ་སེམས་པར་གྱུར་ལ། བསམས་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོན་དེ་ལྟར་དེའི་ཉིན་མོ་ནི་དོན་ཡོད་པ་ཡིན་ཏེ།
en: However, if the bodhisattvas spend two, three, or four days contemplating generosity, discipline, patience, diligence, concentration, and insight, and also dedicate these perfections toward unsurpassed and perfect awakening, then their time becomes meaningful.

source: སྦྱིན་པ་དེ་ཡང་འབྲས་བུ་དང་བཅས་པ་ཡིན་ནོ། །ཚུལ་ཁྲིམས་སམ། བཟོད་པའམ། བརྩོན་འགྲུས་སམ། བསམ་གཏན་རྣམས་སམ། ཤེས་རབ་གང་ཡང་རུང་བ་སྒོམ་པ་དེ་ཡང་འབྲས་བུ་དང་བཅས་པ་ཡིན་ནོ།
en: All of their meditations on generosity, discipline, patience, diligence, concentration, and insight will bear fruit.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་གང་ཡིན་པ་དང་། དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པའི་བཟོད་པ་གང་ཡིན་པའི་བཟོད་པ་འདི་གཉིས་ལ་ཁྱད་པར་ནི་ཅི་ཡོད།
en: Śāradvatīputra asked, “Venerable Pūrṇa, what is the difference between the patience of the bodhisattvas and the patience of those worthy ones who have exhausted defilements?

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རི་རབ་དང་ཡུངས་འབྲུ་ལ་འདི་ལྟ་སྟེ།
en: Pūrṇa replied, “Venerable Śāradvatīputra, think of the central mountain and a mustard seed.

source: ཆེ་ཆུང་དང་མཐོན་དམན་དང་། ལྕི་ཡང་གི་ཁྱད་པར་ནི་ཅི་ཡོད།
en: How are they different in terms of size, height, and weight?

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་རིའི་རྒྱལ་པོ་རི་རབ་དང་། ཡུངས་འབྲུ་ནི་འདི་ལྟ་སྟེ། ཆེ་ཆུང་དང་། མཐོན་དམན་དང་། ལྕི་ཡང་གི་ཁྱད་པར་དཔག་ཏུ་མེད་དེ།
en: Śāradvatīputra said, “Venerable Pūrṇa, the difference between Meru, the central mountain, and a mustard seed in terms of size, height, and weight is boundless.

source: ཐ་དད་དུ་དབྱེ་བ་དཔག་ཏུ་མེད་དོ། །
en: Their dissimilarity is boundless.”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ཏེ།
en: Pūrṇa said, “Venerable Śāradvatīputra, that is correct.

source: བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་དང་། ཉན་ཐོས་ཀྱིས་བཟོད་པ་ནི་ཁྱད་པར་དཔག་ཏུ་མེད་ཅིང་།
en: The difference between the patience of the bodhisattvas and the patience of the worthy ones is boundless.

source: ཐ་དད་དུ་དབྱེ་བ་དཔག་ཏུ་མེད་དོ།
en: Their dissimilarity is boundless.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། རྒྱ་མཚོ་ཆེན་པོའི་ཆུ་དང་། རྒྱ་མཚོ་ཆེན་པོའི་ཆུ་ལས་སྐྲའི་རྩེ་མོའི་ཁྱོན་གྱིས་ཆུའི་ཐིགས་པ་གཅིག་བླངས་པ་གང་ཡིན་པ་དེ་ལ་ཆེས་མང་བའམ། ཆེས་དཔག་ཏུ་མེད་པ་གང་ཡིན་སྨྲས་པ།
en: Venerable Śāradvatīputra, if you compare the water in the ocean to the water contained in a single drop that is lifted from the ocean using the tip of a hair, which of these two is greater and infinitely larger?”

source: རྒྱ་མཚོ་ཆེན་པོའི་ཆུ་ལ་ནི་སྐྲའི་རྩེ་མོའི་ཁྱོན་གྱིས་བླངས་པའི་ཆུའི་ཐིགས་པ་གཅིག་གིས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས། རྒྱུའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Śāradvatīputra said, “Venerable Pūrṇa, the water contained in a single drop that is lifted from the ocean with the tip of a hair would not constitute even one percent of the water in the ocean. Nor would it measure a thousandth, a hundred thousandth, a millionth, or a trillionth of that. In fact, no number, fraction, enumeration, analogy, or comparison would suffice.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ལ་ཉན་ཐོས་ཀྱིས་བཟོད་པས། བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་ལ།
en: Pūrṇa said, “Venerable Śāradvatīputra, in the same way the patience of the hearers does not constitute even one percent of the patience of bodhisattvas.

source: སྟོང་གི་ཆ་དང་། འབུམ་གྱི་ཆ་དང་། བྱེ་བ་འབུམ་གྱི་ཆ་དང་།
en: Nor does it measure a thousandth, a hundred thousandth, or a trillionth of that.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་བཀའ་སྩལ་པ། གང་པོ་འདི་ལྟར་ཁྱོད་སངས་རྒྱས་ཀྱི་མཐུས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་སྤོབས་པར་བྱས་པ་ལེགས་སོ་ལེགས་སོ།
en: Then the Blessed One said to Venerable Pūrṇa Maitrāyaṇīputra, “Pūrṇa, due to the power of the Buddha you have eloquently explained the bodhisattva great beings’ perfection of patience.

source: །གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའི་ཚད་འཛིན་པར་འདོད་པ་གང་ཡིན་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་བཟོད་པ་ལ་ཚད་འཛིན་པར་འདོད་ཅིང་རབ་ཏུ་རྣམ་པར་འབྱེད་པར་སེམས་སུ་ཟད་དོ།
en: Excellent, excellent! Pūrṇa, if one wishes to grasp the extent of the bodhisattva great beings’ patience this amounts to wishing to grasp and understand the extent of the Thus-Gone One’s patience.

source: གང་པོ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་བཟོད་པ་དཔག་ཏུ་མེད་པ་དང་ལྡན་པ་ཡིན་པའི་ཕྱིར་རོ། །
en: Because, Pūrṇa, bodhisattvas possess boundless patience.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། བྱམས་མའི་བུ་གང་པོ་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱོགས་བཅུ་ནས་ལྷགས་པ་དེ་དག་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: After the Blessed One had said this, Venerable Śāradvatīputra, Pūrṇa Maitrāyaṇīputra, the great hearers and the entire world, including its gods, humans, asuras, and gandharvas, rejoiced and praised what the Blessed One had said.

source: །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ལེའུ་གསུམ་པ་སྟེ་རྫོགས་སོ།། །།
en: This is the third chapter from “The Perfection of Patience.”

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was staying in the Jeta Grove, Anāthapiṇḍada’s park at Śrāvastī, along with a great saṅgha of 1,250 monks.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བས་ཇི་ཙམ་གྱིས་ན། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་ལགས།
en: At that time Venerable Pūrṇa Maitrāyaṇīputra said to the Blessed One, “Blessed One, when bodhisattva great beings strive to awaken to unsurpassed and perfect buddhahood, how should they practice the perfection of diligence?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །གང་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་ཐེག་པ་ལ་གསར་དུ་ཞུགས་པས་དང་པོ་སེམས་བསྐྱེད་པ་ནས་བཟུང་སྟེ།
en: The Blessed One said to Venerable Pūrṇa Maitrāyaṇīputra, “Pūrṇa, bodhisattva great beings who wish to awaken to unsurpassed and perfect buddhahood should first enter this vehicle and arouse the mind of awakening.

source: འདི་ལྟར་བདག་གི་ལུས་འདི་དང་། བདག་གི་ཁོག་པ་འདིས་གཞན་གྱི་བྱ་བ་རྣམས་དང་། གཞན་གྱི་ཡོ་བྱད་རྣམས་ལ་ཐོག་མར་འགྲོ་བར་བྱའོ། །བདག་གིས་སེམས་ཅན་དེ་དག་གི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་སྟེ།
en: To arouse the mind of awakening they should think, ‘I shall devote this body and mind of mine to the welfare and needs of others.

source: དཔེར་ན་བྲན་མོ་ཆུ་ཆུན་བཞིན་དུ་བདག་གིས་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ།
en: I will fulfill the dreams of all beings, just like a servant who fetches water.’

source: །དཔེར་ན་བྲན་མོ་ཆུ་ཆུན་ནི་འདི་ལྟར་བདག་གི་རང་དགར་འདུག་པའམ། ཉལ་བར་མི་བྱའོ།
en: Such a servant thinks, ‘I shall forfeit my own independence, without sitting around or resting.

source: །གལ་ཏེ་བདག་ཁྱིམ་ནས་ཚོང་འདུས་སུ་འགྲོ་བ་ན་རྗེ་བོ་དང་། རྗེ་མོ་དེ་ཉིད་ལ་ཞུས་ཏེ་འགྲོ་བར་བྱའོ།
en: If I should wish to leave this house to go to the market, I will only do so with the permission of my master and my lady.

source: །བཟའ་བའམ། བཅའ་བ་དེ་ཡང་གང་གི་ཚེ། བདག་ལ་གནང་བར་གྱུར་ན་དེའི་ཚེ་བདག་གིས་ཕྱིས་བཟའ་བར་བྱ་སྟེ།
en: Even when it is time for meals and drinks, I shall postpone them if I am called for.

source: བདག་གིས་རྗེ་བོའི་དབང་དུ་གནས་པར་བྱའོ་སྙམ་པ་དེ་བཞིན་དུ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་འདི་ལྟར་བདག་གི་ལུས་ལ་བདག་མི་དབང་སྟེ།
en: I will remain under my Lord’s command.’ Pūrṇa, in the same way bodhisattva great beings who wish to awaken to unsurpassed and perfect buddhahood should engender the mind of awakening, thinking, ‘I am not the master of my own body.

source: གཞན་གྱི་བྱ་བ་རྣམས་དང་། གཞན་གྱི་ཡོ་བྱད་རྣམས་ལ་བདག་གིས་ཕན་ཐོགས་པར་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱ་སྟེ།
en: Instead, I will use it to benefit others with their work and needs.’

source: གང་པོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མི་འབྲལ་བར་བྱའོ།
en: Pūrṇa, in this way bodhisattva great beings should avoid straying from the perfection of diligence.

source: །དེ་ལྟར་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པར་ཡང་བྱའོ།
en: In this way they should practice the perfection of diligence. “

source: །གང་པོ་དཔེར་ན་ལ་ལ་ཞིག་ལ་རྟ་རིན་པོ་ཆེ་ཡོད་དེ་མི་ལ་ལ་ཞིག་གིས་ཞོན་ལ། དེ་ནས་རྟ་རིན་པོ་ཆེ་དེ་འདི་སྙམ་དུ་བདག་གིས་མི་འདིའི་ཡན་ལག་གང་ཡང་རུང་བ་གཡོ་བའམ། སྣང་བར་མི་འགྱུར་བར་བྱའོ་སྙམ་སྟེ།
en: Pūrṇa, as an analogy, when someone owns a precious horse and takes it riding, the precious horse will protect the rider, thinking, ‘I will do my best to avoid shaking or injuring any part of the rider’s body.’

source: དེའི་རྟ་དེ་དག་གི་སེམས་ཀྱི་རང་དགར་མི་འགྲོ་བར། མི་འདི་བདག་གི་ལན་གྱིས་ཉེས་པ་ཅི་ཡང་འབྱུང་བར་མི་བྱའོ་སྙམ་དུ་ཞོན་པའི་མི་དེ་ཉིད་སྲུང་བར་བྱེད་དོ།
en: Forsaking its own independence, the horse will think, ‘I must strive to avoid any missteps that could harm the rider.’

source: །གང་པོ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ལྷག་པར་དམིགས་པར་འདོད་པས་བདག་གི་སེམས་ཀྱི་དབང་དུ་འགྲོ་བར་མི་བྱ་སྟེ།
en: Pūrṇa, in the same way, when bodhisattvas wish to focus on the perfection of diligence they should think, ‘I will not be governed by selfish thoughts.

source: སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་སུ་ཡང་རུང་། བདག་ལ་དམིགས་པས་ཉེས་པ་འབྱུང་བར་མི་འགྱུར་བར་བྱའོ་སྙམ་སྟེ།
en: Instead, I will focus on other beings and people to ensure that no harm befalls them.’

source: ཡོན་ཏན་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་ཡོད་དོ།
en: Such are the qualities that bodhisattva great beings possess.

source: །གང་པོ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་ཕ་རོལ་རྗེས་སུ་བསྲུང་བར་བྱ་ཞིང་། འཐུན་པར་གནས་པར་བྱའོ། །འཐུན་པར་གནས་ཤིང་རྗེས་སུ་སྲུང་ན་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་ཏོ།
en: Pūrṇa, in that way, bodhisattvas should protect others and assist them, because it is by assisting and protecting others that they uphold the perfection of diligence. “

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཕྱིར་མི་ལྡོག་པ་གང་ཡིན་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ནོ།
en: When bodhisattvas have become nonregressing from the state of omniscience, that is the perfection of diligence of bodhisattva great beings.

source: །བྱང་ཆུབ་སེམས་དཔའ་གལ་ཏེ་བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཤིན་ཏུ་ཡོངས་སུ་དག་པར་ཇི་ལྟར་བྱ་ཞེས་ཤིན་ཏུ་ཡུན་རིང་པོར་མཚམས་སྦྱོར་ཞིང་འཁོར་བ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ནོ།
en: It is also the perfection of diligence of the bodhisattvas when bodhisattvas apply themselves to prolonged circling in saṃsāra, while pondering, ‘How can I purify this buddha realm?’

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའམ། སྐྱེ་བ་གཉིས་ཀྱིས་ཐོགས་པའམ། སྐྱེ་བ་གསུམ་གྱིས་ཐོགས་པའམ། ཐེག་པ་ལ་གསར་དུ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་འདི་སྐད་དུ།
en: It is also the perfection of diligence of the bodhisattvas when bodhisattva great beings—whether they are held back in this trichiliocosm by one, two, or three births, or whether they are bodhisattvas who have newly entered this vehicle—say,

source: ཁྱོད་ཐོག་མ་ཁོ་ནར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱིས་ཤིག །
en: ‘May you awaken to unsurpassed and perfect buddhahood first! Then I will awaken later.’

source: ཁོ་བོ་ནི་ཕྱིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ་ཞེས་ཟེར་བ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ནོ། །བྱང་ཆུབ་སེམས་དཔའ་གལ་ཏེ་སློང་བ་མཐོང་ན་གུད་དུ་ཕྱོགས་པར་མི་བྱེད་ཅིང་དབང་པོ་རྣམས་ཀྱང་གཡེང་བར་མི་བྱེད་དེ། སེམས་ཅན་འདི་ནི་བདག་གི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཕན་འདོགས་པ་ཡིན་ནོ་སྙམ་པ་འདི་ཡང་།
en: It is also the perfection of diligence of the bodhisattvas when bodhisattvas who see a beggar, without turning away or getting distracted, think, ‘This person is helping me attain omniscience.’

source: བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ནོ། །བྱང་ཆུབ་སེམས་དཔའ་གལ་ཏེ་སེམས་ཅན་གཅིག་གི་ཆེད་དུ་ཡང་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་བདག་བཙོ་བར་སྤྲོ་བར་བྱེད་ཅིང་སེམས་ཅན་འདི་ནི་བདེ་བར་གྱུར་ཅིག་སྙམ་པ་འདི་ཡང་
en: It is also the perfection of diligence of the bodhisattva great beings when bodhisattvas, who wish to help another person, think, ‘To make this person happy, I will be glad to roast in hell for an eon, or even longer.’ “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ནོ། །གལ་ཏེ་ཡང་ཉི་མ་བསྐལ་པའི་ཚད་ཙམ་དུ་གྱུར་ལ། ཉི་མའི་ཚད་དེ་དག་གི་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་བདག་བཙོ་ཞིང་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་གང་ཡིན་པ་དེ་དག་ནི་དེ་ལས་བྱུང་བར་གྱུར་ཅིག་སྙམ་སྟེ།
en: Bodhisattvas should think, ‘Even if a normal day were to last for an entire eon and there were as many eons consisting of days that long as there are grains of sand in the Ganges, may I be burned in the great hells for that long, so that those who live in the hells may be free instead!’

source: གལ་ཏེ་དེ་དག་གིས་འཐོབ་པའི་ཆོས་ཤིག་ཡོད་ན་བྱང་ཆུབ་སེམས་དཔས་ཁས་བླང་བར་བྱའོ།
en: If such could be achieved thereby, bodhisattvas would take such an oath.

source: །གལ་ཏེ་ཁས་ལེན་ན་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ནོ།
en: If they do so, that is also the perfection of diligence of the bodhisattvas.

source: །གལ་ཏེ་ཞུམ་ཞིང་མི་དགའ་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ།
en: However, if they should become discouraged and lose optimism, they would be lazy bodhisattvas.

source: །གལ་ཏེ་སེམས་དང་སེམས་སུ་མཉམ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: If they should equalize their minds with others’ minds, they would be bodhisattva great beings who practice diligence.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འཛམ་བུའི་གླིང་འདི་ཁོ་ར་ཁོར་ཡུག་འཕྱག་ཅིང་འོངས་ཏེ། ཕྱོགས་དེ་ཉིད་དུ་འོངས་ནས་འདི་སྐད་དུ། བདག་འོངས་ནས་ཤིན་ཏུ་ཡུན་རིང་ངོ་སྙམ་དུ་སེམས་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ།
en: Lazy bodhisattvas are those who travel to the end of the world and, upon arrival, think, ‘It took me a long time to arrive here.’

source: །གལ་ཏེ་འདི་སྙམ་དུ་བདག་མྱུར་དུ་འོངས་སོ་སྙམ་དུ་སེམས་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ།
en: Should they, however, think, ‘I arrived here quickly,’ they would be practicing diligence.

source: འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ནོ།
en: That is also the perfection of diligence of the bodhisattva great beings. “

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཆོད་རྟེན་ནམ། དགེ་འདུན་གྱི་ཞལ་ཏ་བྱེད་ཅིང་ཉིན་མོ་འགྲོ་བ་ན་འདི་སྙམ་དུ། ཀྱེ་མ་ཉི་མ་འདི་རེ་རིང་འདི་རེ་བུལ་དུ་འགྲོ་སྙམ་དུ་སེམས་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ།
en: Lazy bodhisattvas are those who, while traveling during the day to pay their respects to a stūpa or to the saṅgha, think, ‘Oh my, this day is so long and passes so slowly!’

source: །གལ་ཏེ་འདི་སྙམ་དུ་ཉི་མ་འདི་སེ་གོལ་གཏོགས་པ་ཙམ་གྱིས་སོང་ངོ་སྙམ་དུ་སེམས་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ།
en: On the other hand, bodhisattva great beings who practice diligence will think, ‘This day is passing as quickly as a finger snap.’

source: བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པ་ཡིན་ནོ།
en: Such people are persistently practicing the perfection of diligence.

source: །ཡང་དེའི་ལས་ལོ་གཅིག་གི་བྱ་བ་གང་ཡིན་པའི་ལས་དེ་ཉི་མ་གཅིག་གིས་ལས་འདྲ་བར་བསམ་ཞིང་ལོ་གཅིག་གི་བྱ་བའི་ལས་དེ་ཉི་མ་གཅིག་གིས་ཟིན་པར་བྱའོ།
en: Moreover, not only should they view an entire year’s work as a single day’s work, they should also complete an entire year’s work in a single day.

source: །བསྐལ་པ་ལས་ལྷག་པའི་ཚད་གང་ཡིན་པ་དེ་ཡང་ཉི་མ་གཅིག་ཙམ་དུ་རྩི་ཞིང་འཇུག་པར་བྱའོ།
en: They should even consider more than an eon’s work to be achievable in just a single day, and carry it out.

source: །བསྐལ་པ་གང་ཡིན་པ་དེ་ཡང་ཉི་མ་གཅིག་ཙམ་དུ་བརྩི་བར་བྱའོ།
en: They should regard an eon as merely a day.

source: །གལ་ཏེ་དེ་ལྟར་མི་རྩི་ཞིང་དེ་ལྟར་མི་རྟོག་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ།
en: If they cannot consider an eon’s work to be doable in a single day and regard it as such, those are lazy bodhisattvas.

source: །ཇི་སྟེ་དེ་ལྟར་རྩི་ཞིང་དེ་ལྟར་རྟོགས་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: However, if they are able to adopt that perspective, those bodhisattva great beings are practicing diligence. “

source: །བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པས་བསྐལ་པ་འདི་སྙེད་ཀྱིས་ན་རང་གི་མངོན་པར་ཤེས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་ཞེས་ཀྱང་བསྐལ་པ་རྣམས་ཀྱི་གྲངས་བརྗོད་པར་མི་བྱའོ།
en: Bodhisattvas who are working for the sake of awakening should not put a limit on the number of eons this may take by saying, ‘Due to my clairvoyance, I can say that I will awaken to unsurpassed and perfect buddhahood after such and such many eons.’

source: །གལ་ཏེ་བསྐལ་པ་རྣམས་ཀྱི་ཚད་རྗོད་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ།
en: If they proclaim such a fixed number of eons, those are lazy bodhisattvas.

source: །གལ་ཏེ་དེ་འདི་སྙམ་དུ་བསྐལ་པ་དཔག་ཏུ་མེད་པ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་དུ་ཟིན་ཀྱང་ཕྱིར་ཕྱོགས་པར་ནི་ཡེ་མི་བྱའོ་སྙམ་དུ་སེམས་ན།
en: Instead of that, they should rather think, ‘Even if takes me a limitless number of eons to awaken to unsurpassed and perfect buddhahood, I will never turn my back on saṃsāra.’

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ།
en: That would make them bodhisattva great beings who are practicing diligence.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: Such bodhisattva great beings are practicing the perfection of diligence.

source: །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡང་དག་པར་གནས་པ་ཡིན་ནོ།
en: They are genuinely engaged in the perfection of diligence.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་རོ། །འཁོར་བ་རིང་བར་བྱེད་དོ།
en: They are near to omniscience and are distancing themselves from cyclic existence. “

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ལ་རིའི་རྒྱལ་པོ་རི་རབ་འདི་ཁྱོད་ཀྱིས་ཉི་མ་གཅིག་གིས་ཕིགས་པར་གྱིས་ཤིག་ཅེས་བསྒོ་ལ།
en: Suppose someone told a bodhisattva, ‘You have just one day to dig through Mount Meru, the king of mountains.’

source: གལ་ཏེ་རིའི་རྒྱལ་པོ་རི་རབ་ཀྱི་ཚད་ཇི་ཙམ་པ་འདྲི་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ།
en: If any bodhisattva were then to inquire about the size of the mountain, that would be a lazy bodhisattva.

source: །གལ་ཏེ་རིའི་རྒྱལ་པོ་རི་རབ་ལ་ཡུངས་འབྲུ་ཙམ་ཞིག་འབིགས་པར་ནུས་སུ་ཟིན་ཀྱང་རིའི་རྒྱལ་པོ་རི་རབ་འདི་ལྟ་བུ་ཞིག་ལ་དབུག་ཏུ་ཅི་ཡོད་དེ་འདི་ནི་ཕིགས་ཟིན་པ་དང་འདྲའོ་སྙམ་དུ་མཐོང་ཞིང་།
en: Rather, even if they were only able to make a dent the size of a mustard seed in Mount Meru, the king of mountains, they should think to themselves, ‘My job of digging through Mount Meru, the king of mountains, is as good as done.

source: ཉིན་གཅིག་ཀྱང་ཡུན་རིངས་ཀྱིས་སེ་གོལ་གཏོགས་པ་ཙམ་གྱིས་དབུག་གོ་སྙམ་སྟེ་དེ་ལྟར་རྩི་བར་འཇུག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: This single day is passing as quickly as a finger snap.’ If they can adopt such an attitude, those bodhisattva great beings are practicing diligence.

source: །གང་གཱའི་ཀླུང་གི་བྱེ་མ་ཇི་སྙེད་ཡོད་པ་དེ་སྙེད་ཀྱི་བསྐལ་པ་ཉིན་ཞག་གཅིག་ཏུ་གྱུར་དུ་ཟིན་ལ།
en: Likewise, suppose a day lasted as many eons as there are grains of sand in the Ganges.

source: ཉིན་མཚན་གྱི་ཚད་དེ་དག་གི་བསྐལ་པ་དཔག་ཏུ་མེད་པ་དག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་དགོས་སུ་ཟིན་ན་ཡང་།
en: And suppose that one would need limitless eons of such days to awaken to unsurpassed and perfect buddhahood.

source: མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཟིན་པ་དང་འདྲ་བར་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཡང་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: If bodhisattva great beings then were to look at the attainment of perfect awakening as if it were basically already attained, they would be practicing diligence. “

source: །གལ་ཏེ་བརྩོན་འགྲུས་རྩོམ་པ་འདིའི་བསྔགས་པ་རྗོད་པ་ན་ཞུམ་ཞིང་སྐྲག་པར་འགྱུར་ན་ནི། བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱ་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཞིང་ལ་འཇུག་པར་མི་འགྱུར་རོ།
en: If bodhisattvas should become discouraged or worried when the practice of diligence is praised, then those are lazy bodhisattvas and they will not be entering the field of omniscience.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བསྔགས་པ་རྗོད་པ་ན་འདི་ལྟར་བདག་ཡོན་ཏན་འདི་ལྟ་བུ་འདི་དག་དང་ནམ་ཞིག་ལྡན་པར་འགྱུར་ཞིག་གུ་སྙམ་པའི་སེམས་འབྱུང་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ། །གལ་ཏེ་ཡོན་ཏན་འདི་དག་ནི་བདག་ལ་ཡོད་དོ་སྙམ་དུ་བདག་ཉིད་ཀྱིས་ཤེས་ཏེ། བདག་བརྩོན་འགྲུས་ཀྱི་ཡོན་ཏན་འདི་དག་གི་ཕ་རོལ་ཏུ་འགྲོ་བར་བྱའོ་སྙམ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: When the perfection of diligence is praised, lazy bodhisattvas will think to themselves, ‘When will I ever have such qualities?’ On the other hand, bodhisattvas who are practicing diligence will recognize, ‘I already have these qualities! I just need to perfect my qualities of diligence.’

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་ལག་པའམ། རྐང་པའམ། མགོ་སློང་བ་ན། གལ་ཏེ་བྱིན་ན་ནི་ལག་པ་མེད་པ་དང་། རྐང་པ་མེད་པ་དང་། མགོ་མེད་པ་སྙམ་དུ་སེམས་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ།
en: Lazy bodhisattvas will think, ‘If I oblige someone who is asking for my hands, feet, or head, I will no longer have any hands, feet, or head.’

source: །གལ་ཏེ་འདི་སྙམ་དུ་ལག་པའམ། རྐང་པའམ། མགོ་བོ་ཡོངས་སུ་བཏང་ན་བདག་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་བླ་ན་མེད་པའི་ལག་པ་དང་། བླ་ན་མེད་པའི་རྐང་པ་དང་། བླ་ན་མེད་པའི་མགོ་དང་ལྡན་པར་འགྱུར་རོ་སྙམ་དུ་སེམས་ཏེ། དེ་ལྟར་རྩི་བས་འཇུག་ན་བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: However, bodhisattvas who practice diligence will tell themselves, ‘If I give away my hands, feet, or head, I shall take rebirth as a god, human, or asura with extraordinary hands, feet, and head,’ and then act accordingly.

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་མིག་སློང་བ་ན་འདི་སྙམ་དུ་གལ་ཏེ་མིག་བྱིན་ན་ནི་མིག་མེད་པར་འགྱུར་རོ་སྙམ་དུ་སེམས་ན་བྱང་ཆུབ་སེམས་དཔའ་ལེ་ལོ་ཅན་ཡིན་པར་རིག་པར་བྱའོ། །
en: Lazy bodhisattvas are those who, when asked to give away their eyes, think to themselves, ‘If I give away my eyes, I will no longer have any eyes.’

source: གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་མིག་སློང་བ་ན་འདི་སྙམ་དུ་མིག་ཡོངས་སུ་བཏང་བས་བདག་ལྷ་དང་། མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་བླ་ན་མེད་པའི་མིག་དང་ལྡན་ཞིང་། བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་མིག་ཏུ་འགྱུར་བར་བྱའོ་སྙམ་དུ་སེམས་ན་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་བརྩམས་པ་ཡིན་པར་རིག་པར་བྱ་སྟེ། ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་རིང་བར་བྱེད་ཅིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་རོ།
en: However, bodhisattva great beings who practice diligence will think, ‘If I give away my eyes, I shall take rebirth as a god, human, or asura with extraordinary eyes, as well as the peerless eye of wisdom.’ In this way, they will distance themselves from the levels of the hearers and the solitary buddhas and approach the state of omniscience. “
